Autodesk.Revit.DB.FilteredElementCollector.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.FilteredElementCollector.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.FilteredElementCollector.GetFilteredElementCollectorIterator
Returns an element iterator to the elements passing the filters.
Remarks:
Calling this when you have an active iterator to this same collector will result in the first iterator being
stopped by this call.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of elements is not permitted without a filter.
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.GetElementIdIteratorInternal
Returns an element id iterator to the elements passing the filters.
Remarks:
Calling this when you have an active iterator to this same collector will result in the first iterator being
stopped by this call.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of elements is not permitted without a filter.
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.IsViewValidForElementIteration(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Identifies if the particular element is valid for iteration of drawn elements.
Remarks:
Views that have no way of representing drawn elements, such as many view templates, fail this check.
document:
The document.
viewId:
The view id.
Returns:
True if the element is valid for iteration.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.FirstElement
Returns the first element to pass the filter(s).
Remarks:
This will reset the collector to the beginning and find the first element that passes the applied filter(s).
If you have an active iterator to this same collector it will be stopped by this call.
Returns:
The first element.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of elements is not permitted without a filter.
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.FirstElementId
Returns the id of the first element to pass the filter(s).
Remarks:
This will reset the collector to the beginning and find the first element that passes the applied filter(s).
If you have an active iterator to this same collector it will be stopped by this call.
Returns:
The first element id.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of elements is not permitted without a filter.
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.ToElements
Returns the complete set of elements that pass the filter(s).
Remarks:
This will reset the collector to the beginning and extract all elements that pass the applied filter(s).
If you have an active iterator to this same collector it will be stopped by this call.
Returns:
The complete set of element ids.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of elements is not permitted without a filter.
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.ToElementIds
Returns the complete set of element ids that pass the filter(s).
Remarks:
This will reset the collector to the beginning and extract all elements that pass the applied filter(s).
If you have an active iterator to this same collector it will be stopped by this call.
Returns:
The complete set of element ids.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of elements is not permitted without a filter.
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.GetElementCount
Gets the number of elements in your current filter.
Remarks:
Does not require a filter, if called on a new FilteredElementCollector it will return a count of all the elements.
Returns:
The number of elements
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.Excluding(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Applies an ExclusionFilter to the collector.
Remarks:
Elements passed to this filter will be automatically excluded from the results.
If you have an active iterator to this collector it will be stopped by this call.
idsToExclude:
The ids to exclude from the results.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input collection of ids was empty, or its contents were not valid for iteration.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.WhereElementIsCurveDriven
Applies an ElementIsCurveDrivenFilter to the collector.
Remarks:
Only elements that are curve driven will pass the collector.
If you have an active iterator to this collector it will be stopped by this call.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.ContainedInDesignOption(Autodesk.Revit.DB.ElementId)
Applies an ElementDesignOptionFilter to the collector.
Remarks:
Only elements that are contained by this particular design option will pass the collector.
If you have an active iterator to this collector it will be stopped by this call.
designOptionId:
The design option id.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.WhereElementIsViewIndependent
Applies an ElementOwnerViewFilter to the collector.
Remarks:
Only elements that are view independent will pass the collector.
If you have an active iterator to this collector it will be stopped by this call.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.OwnedByView(Autodesk.Revit.DB.ElementId)
Applies an ElementOwnerViewFilter to the collector.
Remarks:
Only elements that are owned by this particular view will pass the collector.
If you have an active iterator to this collector it will be stopped by this call.
viewId:
The view id of the owner view.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.WhereElementIsNotElementType
Applies an inverted ElementIsElementTypeFilter to the collector.
Remarks:
Only elements that are not element types will pass the collector.
If you have an active iterator to this collector it will be stopped by this call.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.WhereElementIsElementType
Applies an ElementIsElementTypeFilter to the collector.
Remarks:
Only elements that are ElementTypes will pass the collector.
If you have an active iterator to this collector it will be stopped by this call.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.OfCategoryId(Autodesk.Revit.DB.ElementId)
Applies an ElementCategoryFilter to the collector.
Remarks:
Only elements of this category id will pass the collector.
If you have an active iterator to this collector it will be stopped by this call.
categoryId:
The category id.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.OfClass(System.Type)
Applies an ElementClassFilter to the collector.
Remarks:
Only elements whose class is an exact match to the input class,
or elements whose type is derived from the input class will pass the collector.
There is a small subset of Element subclasses in the API that are not supported
by this filter.  These classes exist in the API, but not in Revit's native object model,
which means that this filter doesn't support them.  In order to use a class filter to
find elements of these types, it is necessary to use a higher level class and then
process the results further to find elements matching only the subclass. For a list
of subclasses affected by this restriction, consult the documentation for ElementClassFilter.
If you have an active iterator to this collector it will be stopped by this call.
type:
The element type.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input type is not a subclass of Element.
-or-
The input type is of an element type that exists in the API, but not in Revit's native object model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.UnionWith(Autodesk.Revit.DB.FilteredElementCollector)
Unites the set of elements passing the filter in this collector
with the set of elements passing the filter in another collector.
Remarks:
The result will be the same as using a LogicalOrFilter to connect this filter with another.
If you have an active iterator to this collector it will be stopped by this call.
other:
The other collector
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The collector does not have a filter applied.  Extraction or iteration of elements is not permitted without a filter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of elements is not permitted without a filter.
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.IntersectWith(Autodesk.Revit.DB.FilteredElementCollector)
Intersects the set of elements passing the filter in this collector
with the set of elements passing the filter in another collector.
Remarks:
The result will be the same as using a LogicalAndFilter to connect this filter with another.
If you have an active iterator to this collector it will be stopped by this call.
other:
The other collector
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The collector does not have a filter applied.  Extraction or iteration of elements is not permitted without a filter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of elements is not permitted without a filter.
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.WherePasses(Autodesk.Revit.DB.ElementFilter)
Applies an element filter to the collector.
Remarks:
The filter will be added as an additional condition that all filtered elements must pass.
If you have an active iterator to this collector it will be stopped by this call.
filter:
The element filter.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FilteredElementCollector.GetElementIterator
Returns an element iterator to the elements passing the filters.
Remarks:
Calling this when you have an active iterator to this same collector will result in the first iterator being
stopped by this call.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of elements is not permitted without a filter.
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.GetElementIdIterator
Returns an element id iterator to the elements passing the filters.
Remarks:
Calling this when you have an active iterator to this same collector will result in the first iterator being
stopped by this call.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of elements is not permitted without a filter.
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.OfCategory(Autodesk.Revit.DB.BuiltInCategory)
Applies an ElementCategoryFilter to the collector.
Remarks:
Only elements of this category id will pass the collector.
category:
The category.
Returns:
This collector.

Autodesk.Revit.DB.FilteredElementCollector.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Constructs a new FilteredElementCollector that will search and filter the visible elements in a view.
Remarks:
Elements that will be passed by the collector have graphics that may be visible in
the input view. Some elements may still be hidden because they are obscured by other elements.
For elements which are outside of a crop region, they may still be passed by the collector because
Revit relies on later processing to eliminate the elements hidden by the crop.
This effect may more easily occur for non-rectangular crop regions, but may also happen even for rectangular crops.
You can compare the boundary of the region with the element's boundary if more precise results are required.
Accessing these visible elements may require Revit to rebuild the geometry of the view.
The first time your code constructs a collector for a given view, or the first time
your code constructs a collector for a view whose display settings have just been changed,
you may experience a significant performance degradation.
document:
The document that owns the view.
viewId:
The view id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
viewId is not a view.
-or-
viewId is not valid for element iteration, because it has no way of representing drawn elements.  Many view templates
will fail this check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.#ctor(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Constructs a new FilteredElementCollector that will search and filter a specified set of elements.
document:
The document that owns the elements matching the element ids.
elementIds:
The input set of element ids.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input collection of ids was empty, or its contents were not valid for iteration.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.#ctor(Autodesk.Revit.DB.Document)
Constructs a new FilteredElementCollector that will search and filter the set of elements in a document.
document:
The document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector
This class is used to search, filter and iterate through a set of elements.
Remarks:
Developers can assign a variety of conditions to filter the elements that are returned.
This class requires that at least one condition be set before making the attempt to access the elements.
Revit will attempt to organize the filters in order to minimize expansion of elements regardless of
the order in which conditions and filters are applied.
There are three groups of methods that you can use on a given collector once you have applied filter(s)
to it.  One group provides collections of all passing elements, a second finds the first match of the given
filter(s), and a third provides an iterator that is evaluated lazily (each element is tested by the filter
only when the iterator reaches it).   You should only use
one of the methods from these group at a time; the collector will reset if you call another method to
extract elements.  Thus, if you have previously obtained an iterator, it will be stopped and traverse no more
elements if you call another method to extract elements.
In .NET, this class supports the IEnumerable interface for Elements.  You can use this class with
LINQ queries and operations to process lists of elements.  Note that because the ElementFilters
and the shortcut methods offered by this class process elements in native code before their
managed wrappers are generated, better performance will be obtained by using as many native filters
as possible on the collector before attempting to process the results using LINQ queries.
One special consideration when using this class in .NET: the debugger will attempt
to traverse the members of the collector because of its implementation of IEnumerable.  You may see strange
results if you also attempt to extract the first element or all elements from the collector while the debugger
is also looking at the contents of the collector.
Since:
2011